node {
  name: "input_image"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 224
        }
        dim {
          size: 224
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "input_label"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "keep_prob"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "phase_train"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "Conv1/truncated_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\013\000\000\000\013\000\000\000\003\000\000\000\031\000\000\000"
      }
    }
  }
}
node {
  name: "Conv1/truncated_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Conv1/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Conv1/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "Conv1/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Conv1/truncated_normal/mul"
  op: "Mul"
  input: "Conv1/truncated_normal/TruncatedNormal"
  input: "Conv1/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/truncated_normal"
  op: "Add"
  input: "Conv1/truncated_normal/mul"
  input: "Conv1/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/Variable"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 11
        }
        dim {
          size: 11
        }
        dim {
          size: 3
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Conv1/Variable/Assign"
  op: "Assign"
  input: "Conv1/Variable"
  input: "Conv1/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv1/Variable"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Conv1/Variable/read"
  op: "Identity"
  input: "Conv1/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv1/Variable"
      }
    }
  }
}
node {
  name: "Conv1/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 25
          }
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Conv1/Variable_1"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Conv1/Variable_1/Assign"
  op: "Assign"
  input: "Conv1/Variable_1"
  input: "Conv1/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv1/Variable_1"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Conv1/Variable_1/read"
  op: "Identity"
  input: "Conv1/Variable_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv1/Variable_1"
      }
    }
  }
}
node {
  name: "Conv1/Conv2D"
  op: "Conv2D"
  input: "input_image"
  input: "Conv1/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 4
        i: 4
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "Conv1/add"
  op: "Add"
  input: "Conv1/Conv2D"
  input: "Conv1/Variable_1/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/bn/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 25
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Conv1/bn/beta"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Conv1/bn/beta/Assign"
  op: "Assign"
  input: "Conv1/bn/beta"
  input: "Conv1/bn/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv1/bn/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Conv1/bn/beta/read"
  op: "Identity"
  input: "Conv1/bn/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv1/bn/beta"
      }
    }
  }
}
node {
  name: "Conv1/bn/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 25
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Conv1/bn/gamma"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Conv1/bn/gamma/Assign"
  op: "Assign"
  input: "Conv1/bn/gamma"
  input: "Conv1/bn/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv1/bn/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Conv1/bn/gamma/read"
  op: "Identity"
  input: "Conv1/bn/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv1/bn/gamma"
      }
    }
  }
}
node {
  name: "Conv1/bn/moments/Mean/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "Conv1/bn/moments/Mean"
  op: "Mean"
  input: "Conv1/add"
  input: "Conv1/bn/moments/Mean/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "Conv1/bn/moments/StopGradient"
  op: "StopGradient"
  input: "Conv1/bn/moments/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/bn/moments/Sub"
  op: "Sub"
  input: "Conv1/add"
  input: "Conv1/bn/moments/StopGradient"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/bn/moments/shifted_mean/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "Conv1/bn/moments/shifted_mean"
  op: "Mean"
  input: "Conv1/bn/moments/Sub"
  input: "Conv1/bn/moments/shifted_mean/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "Conv1/bn/moments/SquaredDifference"
  op: "SquaredDifference"
  input: "Conv1/add"
  input: "Conv1/bn/moments/StopGradient"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/bn/moments/Mean_1/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "Conv1/bn/moments/Mean_1"
  op: "Mean"
  input: "Conv1/bn/moments/SquaredDifference"
  input: "Conv1/bn/moments/Mean_1/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "Conv1/bn/moments/Square"
  op: "Square"
  input: "Conv1/bn/moments/shifted_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/bn/moments/variance"
  op: "Sub"
  input: "Conv1/bn/moments/Mean_1"
  input: "Conv1/bn/moments/Square"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/bn/moments/mean"
  op: "Add"
  input: "Conv1/bn/moments/shifted_mean"
  input: "Conv1/bn/moments/StopGradient"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/bn/moments/Squeeze"
  op: "Squeeze"
  input: "Conv1/bn/moments/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
        i: 1
        i: 2
      }
    }
  }
}
node {
  name: "Conv1/bn/moments/Squeeze_1"
  op: "Squeeze"
  input: "Conv1/bn/moments/variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
        i: 1
        i: 2
      }
    }
  }
}
node {
  name: "Conv1/bn/cond/Switch"
  op: "Switch"
  input: "phase_train"
  input: "phase_train"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "Conv1/bn/cond/switch_t"
  op: "Identity"
  input: "Conv1/bn/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "Conv1/bn/cond/switch_f"
  op: "Identity"
  input: "Conv1/bn/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "Conv1/bn/cond/pred_id"
  op: "Identity"
  input: "phase_train"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 25
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage/Assign"
  op: "Assign"
  input: "bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage"
  input: "bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage/read"
  op: "Identity"
  input: "bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 25
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage/Assign"
  op: "Assign"
  input: "bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage"
  input: "bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage/read"
  op: "Identity"
  input: "bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv1/bn/cond/ExponentialMovingAverage/decay"
  op: "Const"
  input: "^Conv1/bn/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub/x"
  op: "Const"
  input: "^Conv1/bn/cond/switch_t"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub"
  op: "Sub"
  input: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub/x"
  input: "Conv1/bn/cond/ExponentialMovingAverage/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub_1/Switch"
  op: "Switch"
  input: "bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage/read"
  input: "Conv1/bn/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub_1/Switch_1"
  op: "Switch"
  input: "Conv1/bn/moments/Squeeze"
  input: "Conv1/bn/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv1/bn/moments/Squeeze"
      }
    }
  }
}
node {
  name: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub_1"
  op: "Sub"
  input: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub_1/Switch:1"
  input: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub_1/Switch_1:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg/mul"
  op: "Mul"
  input: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub_1"
  input: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg/Switch"
  op: "RefSwitch"
  input: "bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage"
  input: "Conv1/bn/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg"
  op: "AssignSub"
  input: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg/Switch:1"
  input: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1/sub/x"
  op: "Const"
  input: "^Conv1/bn/cond/switch_t"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1/sub/x"
  input: "Conv1/bn/cond/ExponentialMovingAverage/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1/sub_1/Switch"
  op: "Switch"
  input: "bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage/read"
  input: "Conv1/bn/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1/sub_1/Switch_1"
  op: "Switch"
  input: "Conv1/bn/moments/Squeeze_1"
  input: "Conv1/bn/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv1/bn/moments/Squeeze_1"
      }
    }
  }
}
node {
  name: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1/sub_1"
  op: "Sub"
  input: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1/sub_1/Switch:1"
  input: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1/sub_1/Switch_1:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1/sub_1"
  input: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1/Switch"
  op: "RefSwitch"
  input: "bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage"
  input: "Conv1/bn/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1"
  op: "AssignSub"
  input: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1/Switch:1"
  input: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "Conv1/bn/cond/ExponentialMovingAverage"
  op: "NoOp"
  input: "^Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg"
  input: "^Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1"
  input: "^Conv1/bn/cond/switch_t"
}
node {
  name: "Conv1/bn/cond/Identity"
  op: "Identity"
  input: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub_1/Switch_1:1"
  input: "^Conv1/bn/cond/ExponentialMovingAverage"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/bn/cond/Identity_1"
  op: "Identity"
  input: "Conv1/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1/sub_1/Switch_1:1"
  input: "^Conv1/bn/cond/ExponentialMovingAverage"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/bn/cond/Switch_1"
  op: "Switch"
  input: "bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage/read"
  input: "Conv1/bn/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv1/bn/cond/Switch_2"
  op: "Switch"
  input: "bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage/read"
  input: "Conv1/bn/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv1/bn/moments/Squeeze_1/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv1/bn/cond/Merge"
  op: "Merge"
  input: "Conv1/bn/cond/Switch_1"
  input: "Conv1/bn/cond/Identity"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/bn/cond/Merge_1"
  op: "Merge"
  input: "Conv1/bn/cond/Switch_2"
  input: "Conv1/bn/cond/Identity_1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/bn/batchnorm/add/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000474974513
      }
    }
  }
}
node {
  name: "Conv1/bn/batchnorm/add"
  op: "Add"
  input: "Conv1/bn/cond/Merge_1"
  input: "Conv1/bn/batchnorm/add/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/bn/batchnorm/Rsqrt"
  op: "Rsqrt"
  input: "Conv1/bn/batchnorm/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/bn/batchnorm/mul"
  op: "Mul"
  input: "Conv1/bn/batchnorm/Rsqrt"
  input: "Conv1/bn/gamma/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/bn/batchnorm/mul_1"
  op: "Mul"
  input: "Conv1/add"
  input: "Conv1/bn/batchnorm/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/bn/batchnorm/mul_2"
  op: "Mul"
  input: "Conv1/bn/cond/Merge"
  input: "Conv1/bn/batchnorm/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/bn/batchnorm/sub"
  op: "Sub"
  input: "Conv1/bn/beta/read"
  input: "Conv1/bn/batchnorm/mul_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/bn/batchnorm/add_1"
  op: "Add"
  input: "Conv1/bn/batchnorm/mul_1"
  input: "Conv1/bn/batchnorm/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/Relu"
  op: "Relu"
  input: "Conv1/bn/batchnorm/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv2/truncated_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000\031\000\000\0007\000\000\000"
      }
    }
  }
}
node {
  name: "Conv2/truncated_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Conv2/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Conv2/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "Conv2/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Conv2/truncated_normal/mul"
  op: "Mul"
  input: "Conv2/truncated_normal/TruncatedNormal"
  input: "Conv2/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv2/truncated_normal"
  op: "Add"
  input: "Conv2/truncated_normal/mul"
  input: "Conv2/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv2/Variable"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 25
        }
        dim {
          size: 55
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Conv2/Variable/Assign"
  op: "Assign"
  input: "Conv2/Variable"
  input: "Conv2/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv2/Variable"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Conv2/Variable/read"
  op: "Identity"
  input: "Conv2/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv2/Variable"
      }
    }
  }
}
node {
  name: "Conv2/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 55
          }
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Conv2/Variable_1"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 55
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Conv2/Variable_1/Assign"
  op: "Assign"
  input: "Conv2/Variable_1"
  input: "Conv2/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv2/Variable_1"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Conv2/Variable_1/read"
  op: "Identity"
  input: "Conv2/Variable_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv2/Variable_1"
      }
    }
  }
}
node {
  name: "Conv2/Conv2D"
  op: "Conv2D"
  input: "Conv1/Relu"
  input: "Conv2/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "Conv2/add"
  op: "Add"
  input: "Conv2/Conv2D"
  input: "Conv2/Variable_1/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv2/bn/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 55
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Conv2/bn/beta"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 55
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Conv2/bn/beta/Assign"
  op: "Assign"
  input: "Conv2/bn/beta"
  input: "Conv2/bn/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv2/bn/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Conv2/bn/beta/read"
  op: "Identity"
  input: "Conv2/bn/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv2/bn/beta"
      }
    }
  }
}
node {
  name: "Conv2/bn/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 55
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Conv2/bn/gamma"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 55
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Conv2/bn/gamma/Assign"
  op: "Assign"
  input: "Conv2/bn/gamma"
  input: "Conv2/bn/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv2/bn/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Conv2/bn/gamma/read"
  op: "Identity"
  input: "Conv2/bn/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv2/bn/gamma"
      }
    }
  }
}
node {
  name: "Conv2/bn/moments/Mean/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "Conv2/bn/moments/Mean"
  op: "Mean"
  input: "Conv2/add"
  input: "Conv2/bn/moments/Mean/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "Conv2/bn/moments/StopGradient"
  op: "StopGradient"
  input: "Conv2/bn/moments/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv2/bn/moments/Sub"
  op: "Sub"
  input: "Conv2/add"
  input: "Conv2/bn/moments/StopGradient"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv2/bn/moments/shifted_mean/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "Conv2/bn/moments/shifted_mean"
  op: "Mean"
  input: "Conv2/bn/moments/Sub"
  input: "Conv2/bn/moments/shifted_mean/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "Conv2/bn/moments/SquaredDifference"
  op: "SquaredDifference"
  input: "Conv2/add"
  input: "Conv2/bn/moments/StopGradient"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv2/bn/moments/Mean_1/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "Conv2/bn/moments/Mean_1"
  op: "Mean"
  input: "Conv2/bn/moments/SquaredDifference"
  input: "Conv2/bn/moments/Mean_1/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "Conv2/bn/moments/Square"
  op: "Square"
  input: "Conv2/bn/moments/shifted_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv2/bn/moments/variance"
  op: "Sub"
  input: "Conv2/bn/moments/Mean_1"
  input: "Conv2/bn/moments/Square"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv2/bn/moments/mean"
  op: "Add"
  input: "Conv2/bn/moments/shifted_mean"
  input: "Conv2/bn/moments/StopGradient"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv2/bn/moments/Squeeze"
  op: "Squeeze"
  input: "Conv2/bn/moments/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
        i: 1
        i: 2
      }
    }
  }
}
node {
  name: "Conv2/bn/moments/Squeeze_1"
  op: "Squeeze"
  input: "Conv2/bn/moments/variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
        i: 1
        i: 2
      }
    }
  }
}
node {
  name: "Conv2/bn/cond/Switch"
  op: "Switch"
  input: "phase_train"
  input: "phase_train"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "Conv2/bn/cond/switch_t"
  op: "Identity"
  input: "Conv2/bn/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "Conv2/bn/cond/switch_f"
  op: "Identity"
  input: "Conv2/bn/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "Conv2/bn/cond/pred_id"
  op: "Identity"
  input: "phase_train"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "bn/Conv2/bn/moments/Squeeze/ExponentialMovingAverage/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv2/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 55
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "bn/Conv2/bn/moments/Squeeze/ExponentialMovingAverage"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv2/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 55
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "bn/Conv2/bn/moments/Squeeze/ExponentialMovingAverage/Assign"
  op: "Assign"
  input: "bn/Conv2/bn/moments/Squeeze/ExponentialMovingAverage"
  input: "bn/Conv2/bn/moments/Squeeze/ExponentialMovingAverage/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv2/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "bn/Conv2/bn/moments/Squeeze/ExponentialMovingAverage/read"
  op: "Identity"
  input: "bn/Conv2/bn/moments/Squeeze/ExponentialMovingAverage"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv2/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "bn/Conv2/bn/moments/Squeeze_1/ExponentialMovingAverage/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv2/bn/moments/Squeeze_1/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 55
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "bn/Conv2/bn/moments/Squeeze_1/ExponentialMovingAverage"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv2/bn/moments/Squeeze_1/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 55
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "bn/Conv2/bn/moments/Squeeze_1/ExponentialMovingAverage/Assign"
  op: "Assign"
  input: "bn/Conv2/bn/moments/Squeeze_1/ExponentialMovingAverage"
  input: "bn/Conv2/bn/moments/Squeeze_1/ExponentialMovingAverage/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv2/bn/moments/Squeeze_1/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "bn/Conv2/bn/moments/Squeeze_1/ExponentialMovingAverage/read"
  op: "Identity"
  input: "bn/Conv2/bn/moments/Squeeze_1/ExponentialMovingAverage"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv2/bn/moments/Squeeze_1/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv2/bn/cond/ExponentialMovingAverage/decay"
  op: "Const"
  input: "^Conv2/bn/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "Conv2/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub/x"
  op: "Const"
  input: "^Conv2/bn/cond/switch_t"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv2/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Conv2/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub"
  op: "Sub"
  input: "Conv2/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub/x"
  input: "Conv2/bn/cond/ExponentialMovingAverage/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv2/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv2/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub_1/Switch"
  op: "Switch"
  input: "bn/Conv2/bn/moments/Squeeze/ExponentialMovingAverage/read"
  input: "Conv2/bn/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv2/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv2/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub_1/Switch_1"
  op: "Switch"
  input: "Conv2/bn/moments/Squeeze"
  input: "Conv2/bn/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv2/bn/moments/Squeeze"
      }
    }
  }
}
node {
  name: "Conv2/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub_1"
  op: "Sub"
  input: "Conv2/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub_1/Switch:1"
  input: "Conv2/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub_1/Switch_1:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv2/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv2/bn/cond/ExponentialMovingAverage/AssignMovingAvg/mul"
  op: "Mul"
  input: "Conv2/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub_1"
  input: "Conv2/bn/cond/ExponentialMovingAverage/AssignMovingAvg/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv2/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv2/bn/cond/ExponentialMovingAverage/AssignMovingAvg/Switch"
  op: "RefSwitch"
  input: "bn/Conv2/bn/moments/Squeeze/ExponentialMovingAverage"
  input: "Conv2/bn/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv2/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv2/bn/cond/ExponentialMovingAverage/AssignMovingAvg"
  op: "AssignSub"
  input: "Conv2/bn/cond/ExponentialMovingAverage/AssignMovingAvg/Switch:1"
  input: "Conv2/bn/cond/ExponentialMovingAverage/AssignMovingAvg/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv2/bn/moments/Squeeze/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "Conv2/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1/sub/x"
  op: "Const"
  input: "^Conv2/bn/cond/switch_t"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv2/bn/moments/Squeeze_1/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Conv2/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "Conv2/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1/sub/x"
  input: "Conv2/bn/cond/ExponentialMovingAverage/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv2/bn/moments/Squeeze_1/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv2/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1/sub_1/Switch"
  op: "Switch"
  input: "bn/Conv2/bn/moments/Squeeze_1/ExponentialMovingAverage/read"
  input: "Conv2/bn/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn/Conv2/bn/moments/Squeeze_1/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "Conv2/bn/cond/ExponentialMovingAverage/AssignMovingAvg_1/sub_1/Switch_1"
  op: "Switch"
  input: "Conv2/bn/moments/Squeeze_1"
  input: "Conv2/bn/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv2/bn/moments/Squeeze_1"
